{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.3.1.1", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d/kernel", "shape": [9, 9, 3, 64], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_1/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_1/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_2/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_2/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_3/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_3/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_3/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_3/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_4/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_4/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_4/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_4/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_3/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_5/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_5/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_5/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_5/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_6/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_6/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_6/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_6/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_4/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_7/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_7/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_7/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_7/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_8/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_8/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_8/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_8/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_5/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_10/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_9/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_9/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_9/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_9/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_11/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_10/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_10/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_10/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_10/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_6/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_12/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_12/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_11/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_11/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_11/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_11/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_13/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_12/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_12/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_12/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_12/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_7/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_14/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_14/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_13/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_13/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_13/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_13/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_15/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_15/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_14/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_14/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_14/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_14/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_8/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_16/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_16/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_15/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_15/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_15/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_15/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_17/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_17/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_16/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_16/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_16/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_16/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_9/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_18/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_18/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_17/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_17/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_17/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_17/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_19/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_19/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_18/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_18/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_18/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_18/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_10/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_20/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_20/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_19/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_19/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_19/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_19/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_21/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_21/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_20/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_20/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_20/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_20/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_11/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_22/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_22/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_21/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_21/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_21/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_21/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_23/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_23/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_22/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_22/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_22/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_22/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_12/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_24/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_24/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_23/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_23/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_23/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_23/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_25/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_25/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_24/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_24/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_24/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_24/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_13/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_26/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_26/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_25/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_25/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_25/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_25/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_27/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_27/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_26/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_26/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_26/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_26/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_14/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_28/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_28/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_27/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_27/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_27/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_27/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_29/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_29/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_28/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_28/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_28/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_28/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_15/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_30/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_30/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_29/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_29/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_29/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_29/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_31/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_31/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_30/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_30/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_30/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_30/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "p_re_lu_16/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_32/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_32/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_31/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_31/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_31/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_31/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_33/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_33/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_32/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_32/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_32/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_v1_32/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_34/kernel", "shape": [3, 3, 64, 256], "dtype": "float32"}, {"name": "conv2d_34/bias", "shape": [256], "dtype": "float32"}, {"name": "p_re_lu_17/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_35/kernel", "shape": [3, 3, 64, 256], "dtype": "float32"}, {"name": "conv2d_35/bias", "shape": [256], "dtype": "float32"}, {"name": "p_re_lu_18/alpha", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "conv2d_36/kernel", "shape": [9, 9, 64, 3], "dtype": "float32"}, {"name": "conv2d_36/bias", "shape": [3], "dtype": "float32"}]}]}