{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.3.1.1", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d_70/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "conv2d_70/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_71/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_71/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_72/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_72/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_73/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_73/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_74/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_74/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_75/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_75/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_76/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_76/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_77/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_77/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_78/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_78/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_79/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_79/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_80/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_80/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_81/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_81/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_82/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_82/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_83/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_83/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_84/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_84/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_85/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_85/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_86/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_86/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_87/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_87/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_88/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_88/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_89/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_89/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_90/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_90/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_91/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_91/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_92/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_92/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_93/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_93/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_94/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_94/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_95/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_95/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_96/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_96/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_97/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_97/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_98/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_98/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_99/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_99/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_100/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_100/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_101/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_101/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_102/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_102/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_103/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_103/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1_scale_2_2/kernel", "shape": [3, 3, 64, 256], "dtype": "float32"}, {"name": "conv2d_1_scale_2_2/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_2_scale_2_2/kernel", "shape": [3, 3, 64, 256], "dtype": "float32"}, {"name": "conv2d_2_scale_2_2/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_104/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_104/bias", "shape": [3], "dtype": "float32"}]}]}