{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.3.1.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 96, 96, 3], "dtype": "float32", "sparse": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_depthwise", "inbound_nodes": [[["p_re_lu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_depthwise_BN", "inbound_nodes": [[["expanded_conv_depthwise", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "expanded_conv_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "expanded_conv_depthwise_relu", "inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_project", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_project", "inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_project_BN", "inbound_nodes": [[["expanded_conv_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "expanded_conv_add", "trainable": true, "dtype": "float32"}, "name": "expanded_conv_add", "inbound_nodes": [[["p_re_lu", 0, 0, {}], ["expanded_conv_project_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_1_expand", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_1_expand", "inbound_nodes": [[["expanded_conv_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_1_expand_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_1_expand_BN", "inbound_nodes": [[["block_1_expand", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_1_expand_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_1_expand_relu", "inbound_nodes": [[["block_1_expand_BN", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block_1_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block_1_depthwise", "inbound_nodes": [[["block_1_expand_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_1_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_1_depthwise_BN", "inbound_nodes": [[["block_1_depthwise", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_1_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_1_depthwise_relu", "inbound_nodes": [[["block_1_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_1_project", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_1_project", "inbound_nodes": [[["block_1_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_1_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_1_project_BN", "inbound_nodes": [[["block_1_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block_1_add", "trainable": true, "dtype": "float32"}, "name": "block_1_add", "inbound_nodes": [[["expanded_conv_add", 0, 0, {}], ["block_1_project_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_2_expand", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_2_expand", "inbound_nodes": [[["block_1_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_2_expand_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_2_expand_BN", "inbound_nodes": [[["block_2_expand", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_2_expand_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_2_expand_relu", "inbound_nodes": [[["block_2_expand_BN", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block_2_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block_2_depthwise", "inbound_nodes": [[["block_2_expand_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_2_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_2_depthwise_BN", "inbound_nodes": [[["block_2_depthwise", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_2_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_2_depthwise_relu", "inbound_nodes": [[["block_2_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_2_project", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_2_project", "inbound_nodes": [[["block_2_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_2_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_2_project_BN", "inbound_nodes": [[["block_2_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block_2_add", "trainable": true, "dtype": "float32"}, "name": "block_2_add", "inbound_nodes": [[["block_1_add", 0, 0, {}], ["block_2_project_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_3_expand", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_3_expand", "inbound_nodes": [[["block_2_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_3_expand_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_3_expand_BN", "inbound_nodes": [[["block_3_expand", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_3_expand_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_3_expand_relu", "inbound_nodes": [[["block_3_expand_BN", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block_3_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block_3_depthwise", "inbound_nodes": [[["block_3_expand_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_3_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_3_depthwise_BN", "inbound_nodes": [[["block_3_depthwise", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_3_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_3_depthwise_relu", "inbound_nodes": [[["block_3_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_3_project", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_3_project", "inbound_nodes": [[["block_3_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_3_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_3_project_BN", "inbound_nodes": [[["block_3_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block_3_add", "trainable": true, "dtype": "float32"}, "name": "block_3_add", "inbound_nodes": [[["block_2_add", 0, 0, {}], ["block_3_project_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_4_expand", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_4_expand", "inbound_nodes": [[["block_3_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_4_expand_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_4_expand_BN", "inbound_nodes": [[["block_4_expand", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_4_expand_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_4_expand_relu", "inbound_nodes": [[["block_4_expand_BN", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block_4_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block_4_depthwise", "inbound_nodes": [[["block_4_expand_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_4_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_4_depthwise_BN", "inbound_nodes": [[["block_4_depthwise", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_4_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_4_depthwise_relu", "inbound_nodes": [[["block_4_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_4_project", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_4_project", "inbound_nodes": [[["block_4_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_4_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_4_project_BN", "inbound_nodes": [[["block_4_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block_4_add", "trainable": true, "dtype": "float32"}, "name": "block_4_add", "inbound_nodes": [[["block_3_add", 0, 0, {}], ["block_4_project_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_5_expand", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_5_expand", "inbound_nodes": [[["block_4_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_5_expand_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_5_expand_BN", "inbound_nodes": [[["block_5_expand", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_5_expand_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_5_expand_relu", "inbound_nodes": [[["block_5_expand_BN", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block_5_depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block_5_depthwise", "inbound_nodes": [[["block_5_expand_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_5_depthwise_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_5_depthwise_BN", "inbound_nodes": [[["block_5_depthwise", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_5_depthwise_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_5_depthwise_relu", "inbound_nodes": [[["block_5_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_5_project", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_5_project", "inbound_nodes": [[["block_5_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_5_project_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_5_project_BN", "inbound_nodes": [[["block_5_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block_5_add", "trainable": true, "dtype": "float32"}, "name": "block_5_add", "inbound_nodes": [[["block_4_add", 0, 0, {}], ["block_5_project_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_10", "inbound_nodes": [[["block_5_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}], ["p_re_lu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_11", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "DepthToSpace", "trainable": true, "dtype": "float32", "node_def": {"name": "DepthToSpace", "op": "DepthToSpace", "input": ["conv2d_11/Identity"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "block_size": {"i": "2"}}}, "constants": {}}, "name": "tf_op_layer_DepthToSpace", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_1", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_1", "inbound_nodes": [[["tf_op_layer_DepthToSpace", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_12", "inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "DepthToSpace_1", "trainable": true, "dtype": "float32", "node_def": {"name": "DepthToSpace_1", "op": "DepthToSpace", "input": ["conv2d_12/Identity"], "attr": {"block_size": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, "constants": {}}, "name": "tf_op_layer_DepthToSpace_1", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_2", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_2", "inbound_nodes": [[["tf_op_layer_DepthToSpace_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_13", "inbound_nodes": [[["p_re_lu_2", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["conv2d_13", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_7/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block_1_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "block_1_depthwise/bias", "shape": [192], "dtype": "float32"}, {"name": "block_1_depthwise_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_1_depthwise_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_1_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_1_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_1_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "block_1_expand/bias", "shape": [192], "dtype": "float32"}, {"name": "block_1_expand_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_1_expand_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_1_expand_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_1_expand_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_1_project/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "block_1_project/bias", "shape": [32], "dtype": "float32"}, {"name": "block_1_project_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "block_1_project_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "block_1_project_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block_1_project_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block_2_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "block_2_depthwise/bias", "shape": [192], "dtype": "float32"}, {"name": "block_2_depthwise_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_2_depthwise_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_2_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_2_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_2_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "block_2_expand/bias", "shape": [192], "dtype": "float32"}, {"name": "block_2_expand_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_2_expand_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_2_expand_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_2_expand_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_2_project/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "block_2_project/bias", "shape": [32], "dtype": "float32"}, {"name": "block_2_project_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "block_2_project_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "block_2_project_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block_2_project_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block_3_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "block_3_depthwise/bias", "shape": [192], "dtype": "float32"}, {"name": "block_3_depthwise_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_3_depthwise_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_3_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_3_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_3_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "block_3_expand/bias", "shape": [192], "dtype": "float32"}, {"name": "block_3_expand_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_3_expand_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_3_expand_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_3_expand_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_3_project/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "block_3_project/bias", "shape": [32], "dtype": "float32"}, {"name": "block_3_project_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "block_3_project_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "block_3_project_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block_3_project_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block_4_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "block_4_depthwise/bias", "shape": [192], "dtype": "float32"}, {"name": "block_4_depthwise_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_4_depthwise_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_4_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_4_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_4_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "block_4_expand/bias", "shape": [192], "dtype": "float32"}, {"name": "block_4_expand_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_4_expand_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_4_expand_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_4_expand_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_4_project/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "block_4_project/bias", "shape": [32], "dtype": "float32"}, {"name": "block_4_project_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "block_4_project_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "block_4_project_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block_4_project_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block_5_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "block_5_depthwise/bias", "shape": [192], "dtype": "float32"}, {"name": "block_5_depthwise_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_5_depthwise_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_5_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_5_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_5_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "block_5_expand/bias", "shape": [192], "dtype": "float32"}, {"name": "block_5_expand_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_5_expand_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_5_expand_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_5_expand_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_5_project/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "block_5_project/bias", "shape": [32], "dtype": "float32"}, {"name": "block_5_project_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "block_5_project_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "block_5_project_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block_5_project_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv2d_10/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_11/kernel", "shape": [3, 3, 32, 128], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_12/kernel", "shape": [3, 3, 32, 128], "dtype": "float32"}, {"name": "conv2d_12/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_13/kernel", "shape": [3, 3, 32, 3], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_depthwise/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "expanded_conv_depthwise/bias", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_depthwise_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_depthwise_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_depthwise_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_depthwise_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_project/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "expanded_conv_project/bias", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_project_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_project_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_project_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_project_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "p_re_lu/alpha", "shape": [1, 1, 32], "dtype": "float32"}, {"name": "p_re_lu_1/alpha", "shape": [1, 1, 32], "dtype": "float32"}, {"name": "p_re_lu_2/alpha", "shape": [1, 1, 32], "dtype": "float32"}]}]}